098_Мастер_Ра_разработка/src/Documents/Счет/Счет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Счет</name>
  <basedOn>Document.Заявка</basedOn>
  <attributes>
    <name>Акт</name>
    <type>
      <types>DocumentRef.Акт</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НДС_В_томЧисле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Отвественный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Продукция</types>
      </type>
    </attributes>
    <attributes>
      <name>КодЗаказа</name>
      <type>
        <types>DocumentRef.Заявка</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

098_Мастер_Ра_разработка/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>НДС18</name>
    <comment>(Общ) Ставка НДС 18%</comment>
  </enumValues>
  <enumValues>
    <name>НДС18_118</name>
    <comment>(Общ) Расчетная ставка НДС 18% / 118%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <comment>(Общ) Ставка НДС 10%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10_110</name>
    <comment>(Общ) Расчетная ставка НДС 10% / 110%</comment>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>(Общ) Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <comment>(Общ) Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС20_120</name>
    <comment>(Общ) Расчетная ставка НДС 20% / 120%</comment>
  </enumValues>
  <enumValues>
    <name>НДС5</name>
  </enumValues>
  <enumValues>
    <name>НДС5_105</name>
  </enumValues>
  <enumValues>
    <name>НДС7</name>
  </enumValues>
  <enumValues>
    <name>НДС7_107</name>
  </enumValues>
</mdclass:Enum>

098_Мастер_Ра_разработка/src/Documents/Акт/Акт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Акт</name>
  <basedOn>Document.Счет</basedOn>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоАктам</registerRecords>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВозвратаВБухгалтерию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Копия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.Счет</types>
    </type>
  </attributes>
  <attributes>
    <name>Отвественный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетФактура</name>
    <type>
      <types>DocumentRef.СчетФактураВыданный</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Статусы</types>
    </type>
  </attributes>
  <attributes>
    <name>Инвестор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Стройка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СметнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Продукция</types>
      </type>
    </attributes>
    <attributes>
      <name>КодЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

098_Мастер_Ра_разработка/src/Documents/Счет/Forms/ФормаДокумента/Module.bsl
// @strict-types

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьБанковскийСчет();
КонецПроцедуры

 &НаСервере
Процедура ЗаполнитьБанковскийСчет()
	Объект.БанковскийСчет = Объект.Организация.БанковскийСчет; 
КонецПроцедуры	 

&НаКлиенте
Процедура ТоварыКодЗаказаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ЗаполнитьПоЗаказу(ТекущиеДанные.НомерСтроки-1);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоЗаказу(НомерСтроки) 
	текСтрока = Объект.Товары[НомерСтроки];
	Если ТипЗнч(текСтрока.КодЗаказа) = Тип("ДокументСсылка.Заявка") Тогда 		
		текСтрока.Номенклатура = текСтрока.КодЗаказа.ИнформацияВСчете;
		текСтрока.Количество   =1;
		текСтрока.Всего        = текСтрока.КодЗаказа.ИтогоЗаВесьЗаказ; 
		текСтрока.НДС 			= Объект.Организация.СтавкаНДС;
		Если текСтрока.НДС = Перечисления.СтавкиНДС.НДС20 Тогда 
			текСтрока.СуммаНДС      = текСтрока.КодЗаказа.ИтогоЗаВесьЗаказ*20/120;		
		иначе
			текСтрока.СуммаНДС      = 0;
		КонецЕсли;
		текСтрока.Цена         = текСтрока.КодЗаказа.ИтогоЗаВесьЗаказ-текСтрока.СуммаНДС;
		текСтрока.Сумма        = текСтрока.КодЗаказа.ИтогоЗаВесьЗаказ-текСтрока.СуммаНДС;
	ИначеЕсли ТипЗнч(текСтрока.КодЗаказа) = Тип("ДокументСсылка.КартаЗаказа") Тогда 
		ЗаполнитьЗначенияСвойств(текСтрока,текСтрока.КодЗаказа);	
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Расчитать();
КонецПроцедуры

&НаКлиенте
Процедура Расчитать()
	ТекущиеДанные =  Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена*ТекущиеДанные.Количество;
	Если Строка(ТекущиеДанные.НДС) = "Без НДС" Тогда
		ТекущиеДанные.СуммаНДС = 0;
	иначеЕсли Строка(ТекущиеДанные.НДС) = "18%" Тогда
		Если Объект.НДС_В_томЧисле Тогда
			ТекущиеДанные.СуммаНДС = ТекущиеДанные.Сумма/118*18;
		иначе	
			ТекущиеДанные.СуммаНДС = ТекущиеДанные.Сумма*0.18;
		КонецЕсли;
	иначеЕсли Строка(ТекущиеДанные.НДС) = "20%" Тогда
		Если Объект.НДС_В_томЧисле Тогда
			ТекущиеДанные.СуммаНДС = ТекущиеДанные.Сумма/120*20;
		иначе	
			ТекущиеДанные.СуммаНДС = ТекущиеДанные.Сумма*0.2;
		КонецЕсли;
		ИначеЕсли Строка(ТекущиеДанные.НДС) = "5%" Тогда
		Если Объект.НДС_В_томЧисле Тогда
			ТекущиеДанные.СуммаНДС = ТекущиеДанные.Сумма / 105 * 5;
		Иначе
			ТекущиеДанные.СуммаНДС = ТекущиеДанные.Сумма * 0.05;
		КонецЕсли;
	ИначеЕсли Строка(ТекущиеДанные.НДС) = "7%" Тогда
		Если Объект.НДС_В_томЧисле Тогда
			ТекущиеДанные.СуммаНДС = ТекущиеДанные.Сумма / 107 * 7;
		Иначе
			ТекущиеДанные.СуммаНДС = ТекущиеДанные.Сумма * 0.07;
		КонецЕсли;	
	КонецЕсли;
	Если Объект.НДС_В_томЧисле Тогда
		ТекущиеДанные.Всего	= ТекущиеДанные.Сумма;
	иначе	
		ТекущиеДанные.Всего	= ТекущиеДанные.Сумма+ТекущиеДанные.СуммаНДС;
	КонецЕсли;
	ВсегоНДС 				= Объект.Товары.Итог("СуммаНДС");
	Объект.СуммаДокумента 	= Объект.Товары.Итог("Всего");
КонецПроцедуры	
	
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	Расчитать();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНДСПриИзменении(Элемент)
	Расчитать();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не Параметры.Ключ.Пустая() Тогда 
		ВсегоНДС = Объект.Товары.Итог("СуммаНДС");
		Если  Не Объект.СуммаДокумента = Объект.Товары.Итог("Всего") Тогда 
			Объект.СуммаДокумента = Объект.Товары.Итог("Всего");
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.Акт) Тогда 
			
			//Найдем акт	
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Акт.Ссылка
			|ИЗ
			|	Документ.Акт КАК Акт
			|ГДЕ
			|	Акт.Основание = &Основание";
			
			Запрос.УстановитьПараметр("Основание",Объект.Ссылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл 
				Объект.Акт =  Выборка.Ссылка;
				Модифицированность = Истина;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	текСтрока = Элементы.Товары.ТекущиеДанные;
	СодержаниеНоменклатуры = ПолучитьСодержаниеНоменклатуры(текСтрока.Номенклатура); //13.08.20
	Если ЗначениеЗаполнено(СодержаниеНоменклатуры) Тогда 
		текСтрока.Содержание = СодержаниеНоменклатуры;	
	иначе
		текСтрока.Содержание = ПолучитьНаименованиеНоменклатуры(текСтрока.Номенклатура);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСодержаниеНоменклатуры(Номенклатура)
	Возврат Номенклатура.Содержание;
КонецФункции	

&НаСервере
Функция ПолучитьНаименованиеНоменклатуры(Номенклатура)
	Возврат Номенклатура.Наименование;
КонецФункции	

&НаКлиенте
Процедура ТоварыВсегоПриИзменении(Элемент)
	ТекущиеДанные =  Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные.СуммаНДС>0 Тогда 
		Если НЕ ТекущиеДанные.Всего = ТекущиеДанные.Сумма+ТекущиеДанные.СуммаНДС Тогда 
			Сообщить("В строке:"+ТекущиеДанные.НомерСтроки+" (Сумма+Сумма НДС) не равна (Всего)"
			+Символы.ПС+"Для документа с НДС, не должно быть так");
			ТекущиеДанные.Всего = ТекущиеДанные.Сумма+ТекущиеДанные.СуммаНДС;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
